FQN_SEPARATOR = "::"
DEFAULT_BATCH_SIZE_FOR_VECTOR_STORE = 1000
DATA_POINT_FQN_METADATA_KEY = "_data_point_fqn"
DATA_POINT_HASH_METADATA_KEY = "_data_point_hash"

TEXT_SEPARATORS = ["\n1", "\n2", "\n3", "\n4", "\n5", "\n6", "\n7", "\n8", "\n9",
                   " Статья ", " а)", " б)", " в)", " г)", " д)", " е)", " Ж)", " з)",
                   "\n\n", ";\n", "\n \n", "\t", "\n", ";", "."]

STRS_TO_DELETE = [
""" \n \n \n  \n \nБесплатная юридическая консультация по телефонам: 
• 8 (499) 938-53-71 (Москва и МО); \n \n• 8 (812) 467-95-28 (Санкт-Петербург и ЛО); 
• 8 (800) 301-92-12 (Регионы РФ). \n \n \n \nКомментарии к статьям на сайте 
https://constitutionrf.ru/ \n  \n \n""",

"""Бесплатная юридическая консультация по телефонам  
• 8 (499) 938-53-71 (Москва и МО); \n \n• 8 (812) 467-95-28 (Санкт-Петербург и ЛО); 
• 8 (800) 301-92-12 (Регионы РФ)""",

"""\nКонсультантПлюс\nнадежная правовая поддержка\nwww.consultant.ru\n""",

"""Документ предоставлен КонсультантПлюс""",

"""Дата сохранения: """
]
